Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: དེ་ན་མི་དང་མི་མ་ཡིན་པ་དང་། རི་དགས་དང་། བྱ་ལ་སོགས་པ་ལས་དཀར་པོའི་མཐའ་ལ་མངོན་པར་བརྩོན་པ། འཇིགས་པ་ཐམས་ཅད་སྤངས་པ། བདེ་བ་དང་། ཡིད་བདེ་བ་ཐམས་ཅད་དང་ལྡན་པས་ཉིན་མཚན་འདའ་བར་བྱེད་པ་དང་། དགེ་བ་དང་། སྦྱིན་པ་དང་། དུལ་བ་དང་། ཡང་དག་པར་སྡོམ་པ་ལ་མངོན་པར་དགའ་བ་དང་། ལུས་དང་། སེམས་མི་ངལ་བར་བྱང་ཆུབ་ཀྱི་ལམ་ཚོལ་བ་ལ་བརྩོན་པར་བྱེད་དོ།
en: “They will cause human and nonhuman beings, animals, and birds to engage in wholesome activities, and they will cause all their fear to subside, provide them with all kinds of pleasure and comfort, and ensure that they pass their nights and days in the right way. They will cause them to delight in virtue, generosity, and restraint, they will remove their weariness of body and mind, and they will engage them in the quest of the path to awakening.”

source: །ཡང་འདི་སྐད་ཅེས་ཀྱང་སྨྲས་ཏེ།
en: Āṭavaka, the great general of the yakṣas, then continued:

source: རིགས་ཀྱི་བུ་ཅི་སྟེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱིས་བདག་གི་ལས་ཀྱི་དངོས་གྲུབ་འདི་སྩལ་ཅིང་། བྱིན་གྱིས་རློབ་པར་མཛད་དེ། རྗེས་སུ་ཡི་རང་བར་མཛད་ནས། བདག་གིས་འཁྲུག་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བགྱིད་པ། མ་རུངས་པ་ཐམས་ཅད་དད་པར་བགྱིད་པ། མི་དགེ་བའི་ཕྱོགས་ཐམས་ཅད་བཟློག་པར་བགྱིད་པ།
en: “If, O noble son, all the blessed buddhas would grant me the mastery of activity based on the mantra words of this expanse of the vajra sky , and if they empowered me and gave me their felicitous approval, I would become the reciter and teacher of these mantra words, which are the heart essence of all spirits—words that quell all disturbances, inspire deep faith in beings, restrain all those who reinforce what is unwholesome, and support all those who reinforce what is wholesome.

source: དགེ་བའི་ཕྱོགས་ཐམས་ཅད་འཕེལ་བར་བགྱིད་པ། འབྱུང་པོ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་རྡོ་རྗེ་ནམ་མཁའ་རྟོག་འཇུག་ཅེས་བགྱི་བའི་གསང་སྔགས་ཀྱི་ཚིག་བཤད་ཀྱིས། དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་བདག་གི་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་གྱི་ཚིག་བརྗོད་པ་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ། འདི་ལྟར་བདག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་མ་ལུས་པར་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་གྱི་ཚིག་བརྗོད་པའི་ཡི་གེ་དང་སྒྲས་གང་བར་བགྱིས་ལ། དེ་བཞིན་དུ་ཅི་ནས་ཀྱང་འདིར་ལྷགས་པའི་འཁོར་རྣམས་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་གྱི་ཚིག་བརྗོད་པའི་དོན་དང་ཚིག་དང་ཡི་གེས་ཚིམ་པར་བགྱིའོ།
en: “Thus-gone Śākyamuni, please confer upon me, through your blessings, the maṇḍala of sound that conveys words , so that I may fill this entire buddha field by its means with the sound of enunciated syllables and delight the members of the assembly gathered in it with the meaning, words, and letters that comprise this maṇḍala of sound that conveys words

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་འབྲོག་གནས་ལ་བོས་ཏེ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The thus-gone Śākyamuni then spoke to Āṭavaka, the great general of the yakṣas:

source: །རིགས་ཀྱི་བུ་ནག་པོའི་ཕྱོགས་སྐྲག་པར་བྱ་བ་དང་། དཀར་པོའི་ཕྱོགས་འབར་བར་བྱ་བའི་ཕྱིར། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འདི་དག་གིས་ཁྱོད་ཀྱི་རྡོ་རྗེ་ནམ་མཁའ་རྟོག་འཇུག་ཅེས་བྱ་བའི་འབྱུང་པོ་ཐམས་ཅད་ཀྱི་སྙིང་པོའི་གསང་སྔགས་ཀྱི་གཟུངས་འདིའི་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་གྱི་ཚིག་བརྗོད་པ་བྱིན་གྱིས་བརླབས་ཀྱིས་སྐྱེས་བུ་དམ་པ་ཁྱོད་སྤྲོ་བར་གྱིས་ལ། འཁྲུག་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པ།
en: “In order to scare away the black faction and glorify the white faction, the blessed buddhas now confer upon you, O noble son, the maṇḍala of sound that conveys words for conveying this expanse of the vajra sky—this mantra-dhāraṇī that is the heart essence of all spirits.

source: འབྱུང་པོ་ཐམས་ཅད་ཀྱི་སྙིང་པོའི་གསང་སྔགས་ཀྱི་གཟུངས་མ་རུངས་པ་ཐམས་ཅད་ཟློག་པར་བྱེད་པ་རྡོ་རྗེ་ནམ་མཁའ་རྟོག་འཇུག་ཅེས་བྱ་བའི་གསང་སྔགས་ཀྱི་ཚིག་དེ་དག་སྨྲོས་ཤིག །
en: Act with courage, O good man, and recite the mantra words of this expanse of the vajra sky that quells all disturbances—this mantra-dhāraṇī that is the heart essence of all spirits and restrains all wicked beings.”

source: དེ་ནས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་འབྲོག་གནས་སྟན་ལས་ལངས་ཏེ། དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། སངས་རྒྱས་ཀྱི་ཞིང་འདི་མ་ལུས་པར་དབྱངས་ཀྱིས་གོ་བར་བྱེད་པ། གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་སྨྲས་སོ། །འདི་ལྟ་སྟེ། དྷུ་མ་དྷུ་མ། དྷུ་མ་དྷུ་མ། དྷཱུ་མ་དྷཱུ་མ། ནི་ལི་ན་ན་ལ། ནོ་ལ་ནཱི་ལ། ཀུ་ཊ་ནི། མ་ཧཱ་ཀུ་ཊ་ནི། ཊ་ཊ་ཊ་ཊོ། མ་ཧཱ་ཏ་ཊ། ཨ་བཱ་ས། ཨ་བྷི། ཨ་བྷི། རི་ཎི་རི་ཎི། མ་ཧཱ་རི་ཎི་རི་ཎི། རི་མི་རི་མི་རི་མི། ད་རི་མི།
en: Āṭavaka, the great general of the yakṣas, now got up from his seat, bowed with folded hands in the direction of the thus-gone Śākyamuni, and, making the entire buddha field resound with the sound of his voice, uttered the following mantra words:

source: རྀ་ཥི་མ་ཧ་རི་ཥི། ཤུ་ལུ་ཤུ་ལུ། མ་ཧཱ་ཤུ་ལུ་ཤུ་ལུ། ཤུ་ལུ་དྷུ། མ་ཧཱ་ཤུ་ལུ་ཤུ་ལུ། ཨུ་གུ་མ། ཀུ་མ་གུ་མ་ན། རི་མི་རི་མི། ཧི་རི་ཧི་རི། ཧི་རི་ཧི་རི། ཧི་རི་ཧི་རི། ཧི་རི་ཧི་རི། ཧི་རི་ཧི་རི། ཧི་རི་ཧི་རི། ནི་མི་ནི་མི། ཧི་ནི་ཧི་ནི།
en: dhuma dhuma dhama dhama dhūma dhūma nili na nala nola milā kuṭanī kuṭane mahākuṭane ṭaṭa ṭaṭo mahāṭaṭo abhaṣa abhi abhi riṇi riṇi mahāriṇi riṇi rimi rimi rimi rimi dārimi riṣe mahāriṣe śulu śulu mahāśulu śulu śulutha mahāśulu śulu uguma guma gumana rimi rimi hiri hiri hiri hiri hiri hiri hiri hiri hiri hiri nimi nimi nihi nihi muni muni buddhi li pravarā sṛṣṭhaloka caryājine jine jina­rṣabha jinā jina jina­rṣabha svāhā

source: མུ་ནི་མུ་ནི། བུད་དྷི་ལི། པྲ་བ་ར་ཅསྲིཥྚ། ལོ་ཀཱ་ཙརྱ། ཛི་ནི་ཛི་ནི། ཛི་ན་རི་ཥ་བྷེ།
en: He then continued:

source: ཛི་ན་ཛི་ན་ཛི་ན་རྀ་ཥ་བྷ་སྭཱ་ཧཱ བཅོམ་ལྡན་འདས་གྲོང་ངམ།
en: “O Blessed One!

source: གྲོང་ཁྱེར་རམ། གྲོང་རྡལ་ལམ།
en: If in any village, town, . . .

source: ལྗོངས་ནས་དམངས་ཀྱི་ཁྱིམ་གྱི་བར་དུ་གང་དང་གང་ན། འབྱུང་པོ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་རྡོ་རྗེ་ནམ་མཁའ་རྟོག་འཇུག་ཅེས་བགྱི་བ། གསང་སྔགས་ཀྱི་ཚིག་རིག་པ་ཆེན་མོ་འདི་བཤད་པའི་ཚེ།
en: or household where this expanse of the vajra sky—this mantra-dhāraṇī that is the heart essence of all spirits, this great spell consisting of mantra words—is recited, the wicked yakṣas . . .

source: དེ་ན་གནོད་སྦྱིན་མ་རུངས་པ་ནས།
en: and kaṭapūtanas do not develop faith in their minds;

source: ལུས་སྲུལ་པོ་མ་རུངས་པའི་བར་དུ་གང་དག་སེམས་མ་དད་པ་དང་། ལུས་དང་། ངག་དང་། ཡིད་ཀྱིས་བསླབ་པའི་སྡོམ་པ་ཡོངས་སུ་མི་ལེན་པ་དང་། སེམས་ཅན་དེ་དག་ལ་བྱམས་པའི་སེམས་ཉེ་བར་མི་གཞོག་པ་དེ་དག་གི་དོན་དུ་བདག་གིས་ཡང་ཤིན་ཏུ་མི་བཟད་པའི་གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་བཤད་དོ། །འདི་ལྟ་སྟེ། ཨད་ཙེ། ཨད་ཙེ། མུ་ནེ།
en: if they do not fully embrace the study and training with their body, speech, and mind; and if they do not give rise to loving kindness for the beings there, then I will recite, for their sake, even more terrible mantra words.

source: མུ་ནེ།
en: They are:

source: ཨ་ག་ནེ། ཧུ་ཧུ། མུ་ནེ་མུ་ནེ། མ་ཧ་རཱི་ཥི་བྷ། ཧུ་ཧུ། ཨ་གྲ་ད་ཎ་ཌེ། ཨ་ཏ་ཨ་ཏ། ཨ་བྷི་བྷུ་ཏ། ཧི་ནི་ཧི་ནི། ཧི་རི་ཧི་རི། ཧི་རི་ཧི་རི། ཧི་རི་ཧི་རི་ཧི་རི། དྲི་གུ་མ། གུ་མ་གུ་མ་གུ་མ་ཧི། ཧི་ལི། ནི་ལི་ནི་ལི། མ་ཧཱ་ནི་ལི། ས་མུ་དྲ། མེ་ཁ། ཧ་ཊ་ཧ་ཊ་ཧ་ཊ། དྷ་ར་ཎ་མེ། དྷ་ར་ཎ་མེ། ཁ་ཀྵ་བ། ཁ་ཀྵ་བ། པྲྀ་ཐི་བི། ཨ་བ་ཏེ་ཛོ་བ་ར་ཡུ་ཨཱ་ཀྵ་ཤ །ཐ་ཐ་ཐ། གུམ་བྷེ་བྷ། གུམ་བྷེ། ཨ་ག་ཤི་གུམ་བྷེ།
en: acche acche mune mune agne hu hu mune mune manārṣabha hu hu akradaṇḍe atadaṇḍe ata ati aṭa hini hini hiri hiri hiri hiri hiri hiri traguma guma guma guma hili hili nili nili mahānili samudramekha haṭa haṭa haṭa dharaṇamekha kṣabhakha kṣabhakha pṛthivī apa tejo vāyv ākāśa ṭha ṭha ṭha guṃbhe bhagumbhe akṣi kumbhe jihvāgu­gumbhe sarvā­guṃbhe raja­gumbhe sabhāstu­gumbhe svāhā

source: ཛི་དྭ་གུམ་བྷེ། སརྦ་ད་ཀ་གུམ་བྷེ། རཱ་ཛཱ་གུམ་བྷེ། ས་མ་ཏ་གུམ་བྷེ་སྭཱ་ཧཱ། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་འབྲོག་གནས་ཀྱིས་གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་སྨྲས་མ་ཐག་ཏུ་དེ་ནས་དེའི་མོད་ལ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལུས་སྲུལ་པོ་ཐམས་ཅད་འཁྲུགས་ཏེ་སྐྲག་ནས།
en: As soon as Āṭavaka, the great general of the yakṣas, intoned these mantra words, all the gods, nāgas, yakṣas, and kaṭapūtanas were jolted with fear, trembling violently wherever they were on earth or in the sky.

source: སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་དང་ནམ་མཁའ་ལ་གནས་པ་ཐམས་ཅད་འདར་རོ། །དེ་ནས་སྐད་ཅིག་དེ་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱི་སྤྱན་སྔར་ཐལ་མོ་སྦྱར་ཏེ། ལན་གསུམ་དུ་འདི་སྐད་ཅེས་སངས་རྒྱས་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: They immediately folded their hands toward the blessed buddhas, bowing three times, and said, “Homage to all the blessed buddhas!

source: །ཕྱག་འཚལ་ལོ། །སངས་རྒྱས་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage, homage to all the blessed buddhas!

source: །གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་འབྲོག་གནས་ཀྱིས་ཤིན་ཏུ་མི་བཟད་པ་འབྱུང་པོ་ཐམས་ཅད་ཀྱི་སྙིང་གནོན་པའི་གསང་སྔགས་ཀྱི་ཚིག་རྣམས་སྨྲས་སོ་ཞེས་བརྗོད་དོ།
en: These mantra words that penetrate the hearts of all the spirits, just intoned by Āṭavaka, the great general of the yakṣas, are extremely terrifying.”

source: །འདུས་པ་ཆེན་པོ་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་ལས། འབྲོག་གནས་ཀྱི་ལེའུ་སྟེ། བཅུ་གཉིས་པའོ།།
en: This concludes the twelfth chapter, about Āṭavaka, in the “ Ratnaketu Sūtra ” from the Great Collection of Mahāyāna sūtras.

source: །།དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་བཞེངས་པའི་བརྡ་དང་། རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་གཤེགས་པའི་བརྡ་བསྟན་ཏོ།
en: Chapter 13 At this time, all the blessed buddhas displayed the signs of rising and returning to their respective buddha fields.

source: །དེ་ནས་དེའི་མོད་ལ་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དང་། ས་དང་ནམ་མཁའ་ལ་གནས་པའི་སེམས་ཅན་རྣམས་ཀྱང་རབ་ཏུ་འདར། ཐམས་ཅད་དང་ལྡན་པའི་ས་འདི་ཡང་གཡོས།
en: At the same moment, the beings of this entire assembly, who were on earth as well as in the sky, shuddered, and so did the entire earth

source: ནམ་མཁའ་ལས་ཀྱང་མེ་ཏོག་གི་ཆར་འབབ། བར་སྣང་ལས་ཀྱང་སིལ་སྙན་བྱེ་བའི་སྒྲ་བྱུང་། སྤོས་དང་། བདུག་པ་ཐམས་ཅད་ཀྱང་ཤིན་ཏུ་བྱུང་།
en: A rain of flowers poured from the sky, millions of instruments resounded in midair, and all kinds of fragrances of perfume and incense were released.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱང་སྣང་བས་ཁྱབ་པར་བྱས་ནས། འཁོར་ཐམས་ཅད་ཐལ་མོ་སྦྱར་ཏེ་འཁོད་དོ།
en: As the entire buddha field filled with light, those in the assembly pressed their hands together.

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཙན་དན་གྱི་དྲི་ཆེན་པོ་ལ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པས་གསོལ་པ། བཅོམ་ལྡན་འདས་མ་འོངས་པའི་དུས་ན། གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པ་དང་། ཡི་གེར་འདྲི་བ་དང་། བྲིས་ནས་འཆང་བར་བགྱིད་པའི་སེམས་ཅན་དེ་དག་དགེ་བའི་རྩ་བ་ཇི་ཙམ་དང་ལྡན་པར་འགྱུར། སེམས་ཅན་དེ་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི། ཆོས་དུ་ཞིག་གིས་བྱིན་གྱིས་བརླབས་པར་འགྱུར།
en: Then Brahmā , lord of the Sahā world, asked the thus-gone Mahācandanagandha, “How many roots of virtue, O Blessed One, will those beings accumulate who in the future uphold and preserve this Dharma discourse—who read it, master it, and teach it authentically and extensively to others? How many roots of virtue will those beings accumulate who set it down in writing and uphold it in writing? What qualities will they be rewarded with by the blessed buddhas?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཙན་དན་གྱི་དྲི་ཆེན་པོས་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཚངས་པ་ཅི་ནས་བདུད་ཀྱི་ཕྱོགས་ཚར་གཅད་པ་དང་། འཐབ་པའི་རྙོག་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱ་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། དམ་པའི་ཆོས་ཡུན་རིང་དུ་གནས་པར་བྱ་བ་དང་། ལམ་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཁམས་དྲུག་བྱིན་གྱིས་བརླབས་སོ། །དེ་བཞིན་དུ་གང་མ་འོངས་པའི་དུས་ན། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པ་ནས་བྲིས་ཏེ།
en: Thus addressed, the blessed, thus-gone Mahācandanagandha replied to Brahmā, lord of the Sahā world, “Just as the six realms, O Brahmā, have been blessed by all the buddhas in order to fend off the black faction of Māra, to pacify all the negativity of the dark age, to bring beings to maturity, to ensure the continuity of this Dharma method for a long time, and to purify the path, so too will the beings of the future be blessed by all the buddhas and bodhisattvas with the ten perquisites if they uphold this Dharma discourse . . .

source: འཆང་བའི་བར་གྱི་སེམས་ཅན་དེ་དག་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་ཆོས་བཅུས་བྱིན་གྱིས་བརླབས་སོ།
en: and write it down and preserve it.

source: །བཅུ་གང་ཞེ་ན། ཚངས་པ་འདི་ལྟ་སྟེ།
en: What are these ten perquisites?

source: སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། སྲིན་པོ་དང་། གྲུལ་བུམ་དེ་དག་ལ་ཁྱོད་ཀྱིས་སེམས་ཅན་དེ་དག་རྟག་ཏུ་སྲུངས་ཤིག །གནོད་པ་ལས་ཟློག་ཤིག །ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་ལས་དགེ་བ་ལ་ཚུད་ཅིག །ཟས་དང་། སྐོམ་དང་། ལོངས་སྤྱོད་དང་། ཀུན་སྤྱོད་པ་མང་པོ་དང་། ནད་མེད་པ་ལ་མཁས་པས་བདག་གི་སྲོག་དང་ཡང་བསྡོས་ལ།
en: Through the power of all the buddhas and bodhisattvas, O Brahmā , you will duly set these beings apart and always protect them from all the gods, nāgas, yakṣas, gandharvas, rākṣasas, and kumbhāṇḍas. (2) You will cause them to turn away from that which is worthless and fully engage their body, speech, and mind in that which is wholesome. (3) You will provide them with ample food, drink, comfort, pleasures, good health, and good fortune when they are alive, and support them at the time when they give up their lives.

source: སེམས་ཅན་དེ་དག་བཟུང་བར་གྱིས་ཤིག །ཅེས་རིག་པས་གཏད་ནས་དེ་དག་གི་དྲན་པ་དང་། བློ་གྲོས་དང་། རྟོགས་པ་དང་། སྤོབས་པ་ལ་མཁས་པས་སྐྱོན་མེད་པར་འགྱུར་རོ། །དེ་དག་གི་ཡིད་ཀྱི་བརྣག་པ་འདོད་པའི་ཡོན་ཏན་དང་ལྡན་པས་གནས་པར་མི་འགྱུར་ཏེ། དེ་དག་སྟོང་པ་ཉིད་ལ་གནས་པར་འགྱུར་རོ།
en: They will become skilled in faultless memory, mental faculties, and eloquence. (5) Being free from attachment to sense pleasures and from mental fabrications, they will be at ease and immersed in emptiness.

source: །དེ་དག་སེམས་ས་དང་མཚུངས་ཤིང་ཟབ་མོ་ལ་བཟོད་པ་དང་ལྡན་ལ་བསྡུ་བའི་དངོས་པོ་བཞི་པོ་ལ་ཡང་བརྩོན་པར་འགྱུར་རོ།
en: Possessed of equanimous minds merged with the dhāraṇī and of profound acceptance, they will engage in the acts of attracting beings.

source: །དགེ་བའི་ཆོས་ལ་གནས་ནས། སེམས་ཅན་གྱི་འཁོར་གྱི་ལུས་ལ་སྙིང་པོ་བླངས་ཏེ། དངོས་པོ་གསུམ་ཡོངས་སུ་དག་པའི་བྱང་ཆུབ་ཀྱི་སྤྱོད་པ་ཉམས་འོག་ཏུ་ཆུད་པར་འགྱུར་རོ། །ཏིང་ངེ་འཛིན་རིན་པོ་ཆེའི་རྒྱལ་མཚན་ཡང་ཐོབ་པར་འགྱུར་ཏེ།
en: Engaged in wholesome practices, devoting their energy to the body of the assembly, completely free from the three things, they will master the conduct of awakening.

source: ཏིང་ངེ་འཛིན་དེས་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་རྣམ་པར་སྤྱོད་པའི་ཤེས་པ་ལ་ཡང་མཁས་པར་འགྱུར་རོ།
en: They will attain the absorption jeweled banner , through which they will become adroit in the insightful knowledge of all absorptions.

source: །འཆི་བའི་དུས་ཀྱི་ཚེ་ཡང་སེམས་ཅན་དེ་དག་གི་མདུན་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཞིང་། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་མདུན་དུ་བདར་བ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་སྟོན་ཅིང་བཞུགས་པ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ཀྱང་མཐོང་བར་འགྱུར་རོ།
en: At the time of dying they will perceive standing in front of them innumerable blessed buddhas, passing their time in the company of their retinues of monks and the hosts of bodhisattvas and explaining the Dharma.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལས་དོན་དང་། ཚིག་དང་ཡི་གེར་ལྡན་པའི་ཆོས་བཤད་པ་དེ་ལྟ་བུ་ཡང་ཐོས་པར་འགྱུར་རོ།
en: They will hear the Dharma that is being thus explained complete with its meaning, words, and letters.

source: །ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འཕགས་པ་ཟང་ཟིང་མེད་པའི་དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བའི་བར་དུ་ཐོབ་ནས། ལས་ཀྱི་སྒྲིབ་པ་མི་དགེ་བ་དེ་དག་ཐམས་ཅད་རྣམ་པར་ཤེས་པ་ཐ་མ་ལ་ཆོས་དང་ལྡན་པས་མགོ་མཉམ་དུ་འགག་པར་འགྱུར་རོ།
en: To ensure that they obtain spiritual joy and grace—noble and distinguished in every respect—all the karmic obstacles of nonvirtue will be extinguished in their last moment of consciousness at the time of dying, in accord with the Dharma.

source: །ཇི་ལྟར་བསམས་པ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བརྫུས་ཏེ་སྐྱེ་བར་འགྱུར་ཞིང་།
en: After death they will take miraculous birth, just as they wished, in pure buddha fields.

source: སངས་རྒྱས་ཀྱི་ཞིང་གང་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་འཚོ་ཞིང་གཞེས་ལ་བཞུགས་ཏེ། ཐེག་པ་ཆེན་པོའི་གཏམ་འབའ་ཞིག་འཆད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་དེ་དག་ཐེག་པ་ཆེན་པོ་ལ་གནས་ཤིང་། སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་དང་ལྡན་པས་སེམས་ནམ་མཁའ་དང་མཚུངས་པའི་སེམས་ཅན་དེ་དག་དང་མཚུངས་པར་འགྲོགས་པར་འགྱུར་ཏེ།
en: They will live together with other beings established in the Mahāyāna, who possess unobscured knowledge and minds equal to the sky, in any of the buddha fields where the blessed buddhas live and pass their time teaching the pure Mahāyāna doctrine.

source: རིང་པོར་མི་ཐོགས་པར་ཡོན་ཏན་དེ་དག་དང་ལྡན་པར་འགྱུར་རོ།
en: Before long, they themselves will acquire the same qualities.

source: །སེམས་ཅན་དེ་དག་རང་གི་སྨོན་ལམ་མ་གཏོགས་པར་ཕྱིན་ཆད་ཉོན་མོངས་པ་ཅན་སྙིགས་མ་ལྔ་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་སུ་སྐྱེ་བར་མི་འགྱུར་ཏེ།
en: They will not be born again in a buddha field afflicted with the five degenerations, unless they aspire to do so.

source: མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: They will swiftly awaken fully and completely to unsurpassed and perfect buddhahood.

source: །ཚངས་པ་ད་ལྟར་དང་མ་འོངས་པའི་དུས་ན། དམ་པའི་ཆོས་ཀྱི་ཚུལ་འདི་འབར་བར་བྱེད་ཅིང་། གཟུངས་ཀྱི་ཕྱག་རྒྱའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པ་ནས་གླེགས་བམ་ལ་བྲིས་ཏེ་འཆང་བའི་བར་གྱི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཆོས་བཅུ་པོ་དེ་དག་གིས་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ།
en: “With these ten perquisites the blessed buddhas will bless these beings who, in present and future times, glorify this Dharma method, and uphold, . . . write down, and preserve this Dharma discourse, this dhāraṇī-seal, in the form of a book.

source: །དེ་དག་ནི་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་སྟེ། ཉེ་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་ལས་རྣམ་པར་གྲོལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོར་འགྱུར་རོ།
en: These beings, blessed by all the buddhas and bodhisattvas, will become bodhisattva great beings who are freed from all depravities stemming from the afflictions.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་རྣམས་ལ་བཀའ་སྩལ་པ།
en: Now the blessed, thus-gone Śākyamuni addressed the world protectors, Śakra and Brahmā

source: ཀྱེ་གྲོགས་པོ་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་སུ་ཕྱོགས་བཅུ་ནས་འདིར་བྱོན་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཁྱེད་ལ་ཐུགས་བརྩེ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཕྱི་རོལ་གྱི་དངོས་པོ་རྣམ་པར་སྦྱངས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། བྱང་ཆུབ་ཀྱི་སྤྱོད་པ་རབ་ཏུ་བསྟན་པ་དང་། བདུད་ཀྱི་ཕྱོགས་ཕམ་པར་བྱ་བ་དང་། ཆོས་ཀྱི་རྒྱལ་མཚན་བསྒྲེང་བ་དང་། སངས་རྒྱས་ཀྱི་བྱ་བ་མ་ལུས་པར་བསྟན་པ་དང་། དཀོན་མཆོག་གསུམ་གྱི་རིགས་རྒྱུན་མི་འཆད་པར་བྱ་བ་དང་། ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱ་བ་དང་། མ་རུངས་པ་ཐམས་ཅད་བཟློག་པ་དང་། འཇིག་པ་ཐམས་ཅད་ལས་བསྲུང་བ་དང་། ལྟ་བ་ངན་པ་ཐམས་ཅད་སྤང་བ་དང་། བྱང་ཆུབ་ཀྱི་ལམ་ལ་གཟུད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་དང་། ལས་དང་ཉོན་མོངས་པ་ཐམས་ཅད་ཟད་པར་བྱ་བའི་ཕྱིར་ངོ་མཚར་ཞིང་རྨད་དུ་བྱུང་བ་སྔོན་མ་ཐོས་པ་གཟུངས་ཀྱི་ཚིག་ཟབ་མོ་རབ་ཏུ་དབྱེ་བ་ལ་འཇུག་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལྟ་བུ་འདི་བཤད་དེ།
en: “Friends, the blessed buddhas here, who have all congregated from the ten directions, have now given this extraordinary and wonderful exposition—this Dharma discourse never heard before on the profound dhāraṇī with its special words. They have given it out of compassion for you and in order to purify the external objects in this world system. They have taught it in order to bring beings to maturity, show them the conduct leading to awakening, defeat the faction of Māra, raise the banner of Dharma, demonstrate by their own example how to carry out the work of all the buddhas, ensure the continuity of the lineage of the Three Jewels, quell all diseases, restrain all wicked beings, protect from all fear, cause beings to abandon wrong views and enter the path of awakening, endow them fully with the ten strengths of a thus-gone one, and exhaust all their action and afflictions.

source: དེས་ཆགས་པ་མེད་པའི་གཟུངས་ལ་སྤོབས་པ་དང་། ཡེ་ཤེས་ནམ་མཁའ་དང་མཚུངས་པ་ལ་གཟུད་པ་དང་། ཚུལ་གཅིག་བའི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོབ་པར་བྱ་བའི་ཕྱིར། ཁྱིམ་དང་། གྲོང་དང་། གྲོང་རྡལ་དང་། གྲོང་ཁྱེར་དང་། ཡུལ་བསྲུང་བ་ནས་གླིང་བཞི་བསྲུང་བ་དང་། ལྷ་དང་། ཀླུ་དང་། མི་དང་། མི་མ་ཡིན་པ་བསྲུང་བ་དང་། འབྲུ་དང་། སྨན་དང་། ལོ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་དང་། ལོ་ཏོག་རྣམས་བསྲུང་བ་དང་། ཆོས་སྨྲ་བ་དང་། ཆོས་ཉན་པའི་བར་དག་བསྲུང་བར་འགྱུར་རོ།
en: They have taught it so that households, villages, towns, districts, . . . and the worlds consisting of four continents, gods, nāgas, yakṣas, human and nonhuman beings, grain, medicinal herbs, leaves, flowers, fruits, crops, Dharma teachers, and Dharma students will be protected. They have taught it to facilitate the attainment of the unobstructed dhāraṇī, the wisdom that is equal to space, and the omniscient wisdom particular to the single principle.

source: །གྲོགས་པོ་དག་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་དངོས་པོ་རེ་རེ་ཡང་སྙིང་རྗེ་ཆེན་པོ་ལ་འཇུག་པའི་ཡེ་ཤེས་ཀྱི་རྒྱུ་འཐུན་པ་རྣམ་པ་བཅུས་བྱིན་གྱིས་བརླབས་སོ།
en: “Through this Dharma discourse, my friends, each and everything in this buddha field has been empowered in ten different ways by the blessed buddhas, as a result of their knowledge suffused with great compassion.

source: །གྲོགས་པོ་དག་དགེ་བའི་ཆོས་ཐམས་ཅད་བྱིན་གྱིས་བརླབས་པའི་ཕྱིར་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་མ་ལུས་པ་ཡོངས་སུ་སྤྱོད་དོ། །སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེས་པ་ཐམས་ཅད་ཀྱི་མཆོད་རྟེན་དུ་གྱུར་པ།
en: Friends, this entire buddha field has been adopted by all the buddhas and bodhisattvas so that it may be blessed with all things virtuous. (2) It has become an object of veneration for all beings born in buddha fields. (3) It represents the teacher.

source: བླ་མའི་གནས་སྟོན་པར་ཀུན་གྱིས་བཀུར་བ་ཕྱག་བྱ་བའི་གནས་སུ་གྱུར་པ་སྟེ།
en: It is generally revered as the spiritual instructor. (5) It is a fitting object of worship.

source: འདི་ལྟར་མཚམས་མེད་པ་ལྔ་བྱེད་པ་མི་དགེ་བའི་རྩ་བ་དང་ལྡན་པ་དག་ཀྱང་ལས་ཀྱི་སྒྲིབ་པ་ཡིད་དུ་མི་འོང་བའི་འབྲས་བུ་དེ་དག་མ་ལུས་པར་ཡོངས་སུ་བྱང་བར་འགྱུར་རོ།
en: It is a place where even those who have roots of nonvirtue, including the five acts of immediate retribution, can completely purify their karmic obscurations, which would otherwise ripen unpleasantly.

source: །དེ་དག་ཐམས་ཅད་ལས་ཀྱི་སྒྲིབ་པ་སྤངས་ནས་དགེ་བའི་ཆོས་རྣམས་ལ་གནས་པར་འགྱུར་ཏེ།
en: Once these karmic obscurations are removed, one can become established in good qualities.

source: གྲོགས་པོ་དག་དེ་ལྟ་བུ་ནི། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སྐྱེས་བུའི་མཐུ་ཆེན་པོའོ། །གྲོགས་པོ་དག་ཁྱེད་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་བསྟི་སྟང་དུ་བྱས་ཏེ། དམ་པའི་ཆོས་འདི་གཟུང་བར་བྱ། བསྲུང་བར་བྱའོ།
en: This buddha field, friends, is the maker of great men—the blessed buddhas. (9) This buddha field, friends, is the place where you should respect the Dharma, uphold it, and protect it.

source: །དམ་པའི་ཆོས་འདི་འཛིན་པའི་གང་ཟག་ཁྱིམ་ན་གནས་པ་དང་། རབ་ཏུ་བྱུང་བ་དང་། ཆོས་ལ་ནན་ཏན་བྱེད་པ་རྣམས་ཀྱང་བསྲུང་བར་བྱའོ།
en: In this buddha field you should also protect the householders and the wandering mendicants who uphold the Dharma, and persons who have adopted the sacred Dharma.

source: །དེ་ལྟར་ན་ཁྱེད་ལ་ཕན་པ་དང་བདེ་བར་འགྱུར་རོ།
en: This will contribute to your own happiness and prosperity.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་གི་རྒྱལ་མཚན་གྱིས་དེའི་ཚེ་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་ཡོན་ཏན་དང་། ཕན་ཡོན་རབ་ཏུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Now, to illustrate the good qualities and benefits of this Dharma discourse, the thus-gone Kusumadhvaja said:

source: །གང་གིས་ཞིང་ཀུན་གསེར་གྱིས་རབ་ཏུ་བཀང་ནས་ནི།
en: “The merit of someone who fills all the fields with gold and offers them

source: །སྐྱོབ་པ་མགོན་པོ་དག་ལ་མཆོད་པ་ཕུལ་བ་བས།
en: To the protectors and guides in order to worship them would be finite;

source: །གང་ཞིག་དམ་པ་མཆོག་གི་མདོ་འདི་འཛིན་བྱེད་ན།
en: A fearless person who upholds this supreme, important sūtra, however,

source: །འཇིགས་མེད་དེས་ནི་བསོད་ནམས་དཔག་ཏུ་མེད་པ་འཐོབ།
en: Would obtain infinite merit.”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་གདུགས་ཀྱི་དཔལ་གྱིས་ཀྱང་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The thus-gone Ratnacchatraśrī said: “By teaching this sūtra one accumulates the same merit as by giving to the eminent sages gold coins equal in number to the grains of sand in the Gaṅgā. “Merit equal to that gained by upholding this sūtra cannot even be attained By giving to the eminent sages

source: །བརྒྱ་ཚད་པ་ཡི་གསེར་རྣམས་ལས།
en: gold coins equal in number

source: །གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད། །ཁྱུ་མཆོག་ཐུབ་ལ་ཕུལ་བས་ནི། །མདོ་འདིའི་བསོད་ནམས་མཚུངས་མི་ཐོབ།
en: to the grains of sand in the Gaṅgā.

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་རི་བོ་བརྩེགས་ཀྱིས་ཀྱང་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The thus-gone Girikūṭa said:

source: །མེ་ཏོག་ཚོགས་ཀྱི་གདུགས་མཆོག་སྤྲིན་རྣམས་ཀྱིས་ནི་ནམ་མཁའ་ཁེབས་བྱས་ཏེ།
en: “Anybody could fill the sky with clouds dense with heaps of the best flowers and parasols
